[
    {
        "name" : "Dragon Ball",
        "description" : "Dragon Ball follows the adventures of the protagonist Goku, a strong naive boy who, upon meeting Bulma, sets out to gather the seven wish-granting Dragon Balls. After becoming a student of martial arts master Master Roshi (also known as Kame Sennin), he and his fellow pupil Krillin enter a tournament that attracts the most powerful fighters in the world. He then sets out on his own and winds up facing and destroying the Red Ribbon Army single-handedly. When Krillin is later murdered after another tournament, Goku exacts revenge on his killer, Piccolo Daimao. Three years later, Goku, now a young adult, must fight Piccolo Daimao's offspring Piccolo. The remaining 325 chapters of the manga were adapted into the Dragon Ball Z anime.",
        "image" : "https://i.pinimg.com/originals/77/82/f0/7782f08f34d373c4caf42aee9160a32d.jpg"
    },
    {
        "name" : "Dragon Ball Z",
        "description" : "Dragon Ball Z picks up five years after the end of the Dragon Ball anime, with Goku now a young adult and father to his son, Gohan. A humanoid alien named Raditz arrives on Earth in a spacecraft and tracks down Goku, revealing to him that he is his long-lost older brother and that they are members of a near-extinct extraterrestrial warrior race called the Saiyans (サイヤ人 Saiya-jin). The Saiyans had sent Goku (originally named 'Kakarot') to Earth as an infant to conquer the planet for them, but he suffered a traumatic brain injury soon after his arrival and lost all memory of his mission, as well as his bloodthirsty Saiyan nature. Goku refuses to help Raditz continue the mission, which results in Raditz kidnapping Gohan. Goku decides to team up with his former enemy Piccolo in order to defeat Raditz and save his son, while sacrificing his own life in the process. In the afterlife, Goku trains under the ruler of the North Galaxy, King Kai, and is taught the Kaio-ken (界王拳) and Spirit Bomb (also known as the Genki Dama (元気玉)) techniques, before being revived by the Dragon Balls a year later in order to save the Earth from Raditz' allies; Nappa and the self-proclaimed 'Prince of all Saiyans', Vegeta, who arrive before Goku returns. Piccolo is killed by Nappa during the battle, along with Goku's allies Yamcha, Tien Shinhan and Chiaotzu (with Chiaotzu sacrificing himself to save Tien), and both Kami and the Dragon Balls cease to exist as a result of Piccolo's death. After Goku finally arrives at the battlefield, he avenges his fallen friends by defeating Nappa with his new level of power. Vegeta executes Nappa for his failure and does battle with Goku, but is ultimately defeated thanks to the efforts of Gohan and Goku's other surviving allies, Krillin and Yajirobe. At Goku's request, they spare Vegeta's life and allow him to escape Earth, with Vegeta vowing to return and destroy the planet out of revenge for his humiliation at Goku's hands. During the battle, Krillin overhears Vegeta mentioning the original set of Dragon Balls from Piccolo's homeworld, Namek (ナメック星 Namekku-sei). While Goku recovers from his injuries, Gohan, Krillin and Goku's oldest friend Bulma depart for Namek in order to use these Dragon Balls to revive their fallen friends. However, they discover that Vegeta's superior, the galactic tyrant Lord Frieza, is already there, looking to use the Dragon Balls for himself so that he can achieve immortality. A fully healed Vegeta arrives on Namek as well, also seeking immortality from the Dragon Balls, which leads to several battles between him and Frieza's henchmen. Realizing he is overpowered, Vegeta teams up with Gohan and Krillin to fight the Ginyu Force, a team of elite mercenaries summoned by Frieza. After Goku finally arrives on Namek, the epic battle with Frieza himself comes to a close when Goku transforms into the fabled Super Saiyan (超サイヤ人 Sūpā Saiya-jin) of legend and defeats him before escaping Namek as the planet is destroyed in a massive explosion.Upon his return to Earth a year later, Goku encounters a time traveler named Trunks, the future son of Bulma and Vegeta, who warns Goku that two Androids (人造人間 Jinzōningen, lit. 'Artificial Humans') will appear three years later, seeking revenge against Goku for destroying the Red Ribbon Army when he was a child. During this time, an evil lifeform called Cell emerges and, after absorbing two of the Androids to achieve his 'perfect form', holds his own fighting tournament to decide the fate of the Earth, known as the 'Cell Games'. After Goku sacrifices his own life a second time, to no avail, Gohan avenges his father by destroying Cell after ascending to the second level of Super Saiyan.Seven years later, Goku is revived for one day to reunite with his loved ones and meet his youngest son, Goten, at the Tenkaichi Budōkai (天下一武道会 'Strongest Under the Heavens Martial Arts Tournament'). Soon after, Goku and his allies are drawn into a fight by the Supreme Kai against a magical being named Majin Buu summoned by the evil wizard Babidi. After numerous battles that result in the deaths of many of Goku's allies as well as the destruction of Earth, Goku (whose life is fully restored by the Elder Supreme Kai) kills Kid Buu (the original and most powerful form of Majin Buu) with a Spirit Bomb attack containing the energy of all the inhabitants of Earth, who were resurrected along with the planet by the Namekian Dragon Balls. Goku makes a wish for Buu to be reincarnated as a good person and ten years later, at another Tenkaichi Budōkai, he meets Buu's human reincarnation, Uub. Leaving the match between them unfinished, Goku departs with Uub to train him to become Earth's new defender.",
        "image" : "http://ptanime.com/wp-content/uploads/2015/05/Dragon_Ball_Z_Analise_Imagem_Saga_Majin_Buu.jpg"
    },
    {
        "name" : "Dragon Ball GT",
        "description" : "Five years after the end of the Dragon Ball Z anime (10 years in the Funimation dub),[2] Goku is accidentally turned back into a child by the Black Star Dragon Balls (究極のドラゴンボール Kyūkyoku no Doragon Bōru, lit. 'Ultimate Dragon Ball') used by his old enemy Emperor Pilaf and is forced to travel across the universe to retrieve them along with his granddaughter Pan and Trunks. The trio go through various adventures in their journey to find the Black Star Dragon Balls, until they encounter the artificial Tuffle parasite, Baby, who intends to destroy the Saiyan race as his revenge for their extermination of the Tuffles many years ago.",
        "image" : "https://vignette2.wikia.nocookie.net/dbz-dokkanbattle/images/9/95/Black_Star_DB_Saga.png/revision/latest?cb=20160910202651"
    },
    {
        "name" : "Dragon Ball Super",
        "description" : "Dragon Ball Super follows the adventures of Goku and his friends after defeating Majin Buu and bringing peace to Earth once again. Goku encounters beings far more powerful and defends the Earth against a powerful destructive deity. He attains the power of a god and learns his newly discovered powers under the gods of his universe. Goku travels to other universes to face more powerful opponents as well as nearly unstoppable foes. A theatrical film titled Dragon Ball Super: Broly was released in 2018, and an ONA called Super Dragon Ball Heroes, based on the events prior to the film and the arcade game of the same name, started airing in July 2018.",
        "image" : "https://i.pinimg.com/originals/81/57/19/81571933f0d137e2d6c98304e0376311.png"
    }
]